# specify a directory to install
cask_args appdir: "/Applications"


# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "mongodb/brew"
tap "hashicorp/tap"
tap "oven-sh/bun"


# install formulae

# tech stack
brew "bun"
brew "mongodb-community@8.0"
brew "node"
brew "postgresql@14"
brew "python@3.13"
brew "sqlite3"
brew "terraform"
brew "yarn"

# tech managers
brew "asdf"
brew "chezmoi"
brew "nvm"
brew "uv"

# cli tools
brew "autojump"
brew "awscli"
brew "bash"
brew "bat"
brew "bruno-cli"
brew "curl"
brew "diff-so-fancy"
brew "duf"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "gh"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jq"
brew "mas"
brew "neofetch"
brew "neovim"
brew "openapi-generator"
brew "pandoc"
brew "ripgrep"
brew "rga"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "tlrc"
brew "tmux"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zstd"

# others
# brew "exercism"

# ai stuff
brew "aider"
brew "llm"
brew "ollama"


# install casks

# apps
cask "anki"
cask "appcleaner"
cask "balenaetcher"
cask "bitwarden"
cask "brave-browser"
cask "bruno"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "discord"
cask "drawio"
cask "figma"
cask "flux"
cask "ghostty"
cask "gimp"
cask "hot"
cask "iina"
cask "imageoptim"
cask "logi-options+"
cask "nordvpn"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "plex-media-server"
cask "raycast"
cask "spotify"
cask "stremio"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
cask "zotero"

# situational
# cask "backblaze"
# cask "cursor"
# cask "docker"
# cask "framer"
# cask "google-drive"
# cask "iterm2"
# cask "keycastr"
# cask "linear-linear"
# cask "loom"
# cask "macwhisper"
# cask "microsoft-office"
# cask "mochi"
# cask "netnewswire"
# cask "notion"
# cask "openemu"
# cask "orbstack"
# cask "scratch"
# cask "screen-studio"
# cask "slack"
# cask "superwhisper"
# cask "vlc"
# cask "vnc-viewer"


# install fonts
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-jetbrains-mono"
cask "font-inconsolata"
cask "font-roboto"
cask "font-roboto-mono"


# install mas
mas "Things-3", id: 904280696
mas "Klack", id: 6446206067
mas "Kindle", id: 302584613
mas "Dropover", id: 1355679052
mas "Photomator", id: 1444636541
mas "Perplexity", id: 6714467650
# mas "Xcode", id: 497799835
# mas "Tailscale", id: 1475387142
