# specify a directory to install
cask_args appdir: "/Applications"

# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "mongodb/brew"

# install formulae
brew "chezmoi"
brew "mas"
brew "tmux"
brew "git"
brew "ffmpeg"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "wget"
brew "curl"
brew "neovim"
brew "fzf"
brew "bat"
brew "autojump"
brew "neofetch"
brew "eza"
brew "diff-so-fancy"
brew "gh"
brew "rga"
brew "ripgrep"
brew "duf"
brew "jq"
brew "yq"
brew "shellcheck"
brew "shfmt"
brew "pandoc"
brew "tlrc"
brew "node"
brew "python@3.13"
brew "ruff"
brew "uv"
brew "postgresql@14"
brew "mongodb-community@8.0"
brew "sqlite3"
# brew "yarn"
# brew "asdf"
# brew "yt-dlp"
# brew "exercism"

# install casks
cask "raycast"
cask "visual-studio-code"
cask "bitwarden"
cask "brave-browser"
cask "google-drive"
cask "spotify"
cask "discord"
cask "obsidian"
cask "transmission"
cask "plex-media-server"
cask "iina"
cask "the-unarchiver"
cask "hot"
cask "flux"
cask "appcleaner"
# cask "iterm2"
cask "ghostty"
cask "cleanshot"
cask "notion-calendar"
cask "figma"
cask "anki"
cask "logi-options+"
cask "zotero"
cask "whatsapp"

# situational

# cask "docker"
# cask "notion"
# cask "calibre"
# cask "orbstack"
# cask "mochi"
# cask "keycastr"
# cask "linear-linear"
# cask "openemu"
# cask "netnewswire"
# cask "vnc-viewer"
# cask "scratch"
# cask "vlc"
# cask "balenaetcher"
# cask "chatgpt"
# cask "claude"
# cask "gimp"
# cask "slack"
# cask "framer"
# cask "obs"
# cask "zoom"
# cask "loom"
# cask "screen-studio"
# cask "microsoft-office"
# cask "postman"
# cask "zed"
# cask "imageoptim"

# install fonts
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-jetbrains-mono"
cask "font-inconsolata"
cask "font-roboto"
cask "font-roboto-mono"

# install mas
mas "Things-3", id: 904280696
mas "Klack", id: 6446206067
mas "Kindle", id: 302584613
mas "Dropover", id: 1355679052
# mas "Xcode", id: 497799835
# mas "Tailscale", id: 1475387142
