# specify a directory to install
cask_args appdir: "/Applications"

# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

# install packages + apps
brew "chezmoi"
brew "git"
brew "neovim"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "bat"
brew "autojump"
brew "neofetch"
brew "eza"
brew "diff-so-fancy"
brew "gh"
brew "ripgrep"
brew "duf"
brew "python@3.13"
brew "ruff"
brew "poetry"
brew "mas"
# brew "tmux"
# brew "zsh"


# install casks
cask "raycast"
cask "dropzone"
cask "visual-studio-code"
cask "bitwarden"
cask "brave-browser"
cask "google-drive"
cask "spotify"
cask "discord"
cask "obsidian"
cask "plex"
cask "iina"
cask "appcleaner"
cask "iterm2"
cask "cleanshot"
cask "notion"
cask "notion-calendar"
cask "figma"
cask "anki"
cask "logi-options+"
cask "font-hack-nerd-font"
# cask "mochi"
# cask "linear-linear"
# cask "openemu"
# cask "netnewswire"
# cask "scratch"

# mas
mas "Things-3", id: 904280696
mas "Klack", id: 6446206067
mas "Kindle", id: 302584613
# mas 'Xcode', id: 497799835
